:PROPERTIES:
:ID:       9fa145ba-0c4f-4553-87e2-70732f2eafc3
:END:
#+title: 进制转换(十、二、十六、八进制)
#+filetags: cpp

* 进制转换(十、二、十六、八进制) [[https://www.learncpp.com/cpp-tutorial/numeral-systems-decimal-binary-hexadecimal-and-octal/][参考]]
1. 常用的进制为：十进制、二进制、十六进制； *内存地址* 通常以 十六进制 输出
   - 二进制   :: 逢  2 进 1
   - 八进制   :: 逢  8 进 1；八进制字面值前需要加 0
   - 十进制   :: 逢 10 进 1
   - 十六进制 :: 逢 16 进 1；十六进制字面值前需要加 0x
   #+name: 示例
   #+begin_example
   Decimal         0     1     2     3     4     5     6     7     8     9    10    11    12    13    14    15
   Binary          0     1    10    11   100   101   110   111  1000  1001  1010  1011  1100  1101  1110  1111
   Octal           0     1     2     3     4     5     6     7    10    11    12    13    14    15    16    17
   Hexadecimal     0     1     2     3     4     5     6     7     8     9     A     B     C     D     E     F

   Decimal        16    17    18    19    20    21    22    23    24    25    26    27    28    29    30    31
   Binary      10000 10001 10010 10011 10100 10101 10110 10111 11000 11001 11010 11011 11100 11101 11110 11111
   Octal          20    21    22    23    24    25    26    27    30    31    32    33    34    35    36    37
   Hexadecimal    10    11    12    13    14    15    16    17    18    19    1A    1B    1C    1D    1E    1F
   #+end_example

2. 在 cpp 中，使用 std::dec、std::oct、std::hex *切换输出格式*
   #+begin_src cpp :results output :namespaces std :includes <iostream>
   int x { 12 };
   std::cout << x << '\n'; // decimal (by default)
   std::cout << std::hex << x << '\n'; // hexadecimal
   std::cout << x << '\n'; // now hexadecimal
   std::cout << std::oct << x << '\n'; // octal
   std::cout << std::dec << x << '\n'; // return to decimal
   std::cout << x << '\n'; // decimal
   #+end_src

   #+RESULTS:
   : 12
   : c
   : c
   : 14
   : 12
   : 12
